var geoCoordMap = {
	"东北路-五一广场(北行)" : [ 121.60916060453, 38.921780091549 ],
	"东快路-黄河街出市" : [ 121.61256717745, 38.921741295275 ],
	"东快路-疏港路东出市" : [ 121.6080098228, 38.934485435395 ],
	"东北路--海达广场(南行)" : [ 121.60767827565, 38.939122266978 ],
	"东快路-工人村入市" : [ 121.60676481767, 38.938252396212 ],
	"东快路-疏港路西入市" : [ 121.6041257863, 38.932388213639 ],
	"东联路-华北路入市上桥" : [ 121.62414602032, 39.023028038811 ],
	"东联路-校园街入市上桥" : [ 121.60172325551, 39.001822993123 ],
	"东联路-松江路入市上桥" : [ 121.5940316301, 38.973543847535 ],
	"东联路-西南路入市下桥" : [ 121.59024647629, 38.949213737346 ],
	"东联路-西安路入市下桥" : [ 121.59927125007, 38.932546792968 ],
	"东联路-疏港路入市上桥" : [ 121.59667422332, 38.93249069093 ],
	"东联路-联合路入市下桥" : [ 121.60281031361, 38.930841053481 ],
	"东联路-联合路出市上桥" : [ 121.60267171566, 38.930837039701 ],
	"东联路-西南路出市上桥" : [ 121.589836057, 38.948746534742 ],
	"东联路-松江路出市下桥" : [ 121.59425598305, 38.973416741549 ],
	"东联路-校园街出市下桥" : [ 121.61369669276, 39.019102007979 ],
	"绿标路-中山路-五一路(西)" : [ 121.60765398779, 38.912828221873 ],
	"绿标路-中山路-联合路(东)" : [ 121.6062771311, 38.912451822121 ],
	"东联路-中华路(南)入市上桥" : [ 121.60177622797, 38.996293208837 ],
	"东联路-中华路(南)入市下桥" : [ 121.60203884774, 38.996119369302 ],
	"东联路-中华路(北)入市上桥" : [ 121.6017885704, 38.99667558414 ],
	"东联路-中华路(北)入市下桥" : [ 121.60194049173, 38.996908342115 ],
	"东联路-中华路(南)出市上桥" : [ 121.6026420441, 38.996329318594 ],
	"东联路-中华路(南)出市下桥" : [ 121.60242522261, 38.996126196025 ],
	"东联路-中华路(北)出市上桥" : [ 121.6023691983, 38.996954550799 ],
	"东联路-中华路(北)出市下桥" : [ 121.60262409077, 38.996701389251 ],
	"东北路--海达广场(北行)" : [ 121.60796160059, 38.939937841766 ],
	"绿标路-会展路-太原街(南)" : [ 121.60122729127, 38.894682726895 ],
	"绿标路-中山路-大同街(东)" : [ 121.61663475956, 38.914064817684 ],
	"绿标路-中山路-大同街(西)" : [ 121.61684837096, 38.914350356175 ],
	"绿标路-会展路-星河街(南)" : [ 121.59958565987, 38.893889699724 ],
	"绿标路-会展路-会展东路(南)" : [ 121.59802639569, 38.894695144957 ],
	"绿标路-会展路-会展西路(南)" : [ 121.59341058426, 38.895166172575 ],
	"绿标路-中山路-会展南路(东)" : [ 121.59129008614, 38.891465422887 ],
	"绿标路-胜利路-白山路(南)" : [ 121.60583376751, 38.904605331896 ],
	"西快路-中山路(匝道)(北行)" : [ 121.59704010329, 38.908120771865 ],
	"西快路-中山路(桥上)(南行)" : [ 121.59570652167, 38.907323210986 ],
	"西快路-五四路(匝道)(南行)" : [ 121.59830959145, 38.905425131675 ],
	"西快路-五四路(匝道)(北行)" : [ 121.59823294986, 38.905519370433 ],
	"西快路-胜利路(南行)" : [ 121.59862975158, 38.901034761035 ],
	"东北路-五一广场(南行)" : [ 121.60903931011, 38.921766459574 ],
	"莲花山隧道(WK2+845)" : [ 121.6190478504, 38.902261285482 ],
	"莲花山隧道(NK0+765)" : [ 121.62287604258, 38.899569563693 ],
	"莲花山隧道(WK1+767-NK0)" : [ 121.61862539552, 38.89726490032 ],
	"莲花山隧道（WK0+918）" : [ 121.61694039617, 38.8893368421 ],
	"莲花山隧道(WK0)" : [ 121.6145323177, 38.878829683062 ],
	"星海湾大桥BHXLK0+060" : [ 121.61873284653, 38.875770339912 ],
	"星海湾大桥AK1+009（B15)" : [ 121.61601530929, 38.876831169557 ],
	"星海湾大桥SK0+940(S20)" : [ 121.61397627228, 38.877567490524 ],
	"星海湾大桥SK1+737（S39)" : [ 121.60061643516, 38.871228837821 ],
	"星海湾大桥SK3+613（S63）" : [ 121.58614884242, 38.873888402682 ],
	"星海湾大桥SK4+537（S84）" : [ 121.56972543624, 38.872523668913 ],
	"星海湾大桥SK5+890（S122）" : [ 121.55643196354, 38.868655957718 ],
	"星海湾大桥XK5+871" : [ 121.55694586873, 38.868246712285 ],
	"星海湾大桥XK4+578（X84）" : [ 121.5698533249, 38.8721317028 ],
	"星海湾大桥XK3+654（X63）" : [ 121.58602739594, 38.873416621263 ],
	"星海湾大桥XK1+778（X39)" : [ 121.60052586449, 38.870885383846 ],
	"星海湾大桥XK0+980(B21）" : [ 121.61313179172, 38.874732016892 ],
	"星海湾大桥XK0+223(X4)" : [ 121.61450312368, 38.87728196085 ],
	"星海湾大桥BK0+172(B4)" : [ 121.61489201416, 38.876829648687 ],
	"莲花山隧道(EK0)" : [ 121.61527081332, 38.878493271933 ],
	"莲花山隧道(EK0+875)" : [ 121.61799643511, 38.890180986476 ],
	"莲花山隧道(EK1+775-SK0)" : [ 121.61937623922, 38.89737845959 ],
	"莲花山隧道(EK2+985)" : [ 121.61958881682, 38.902546667501 ],
	"莲花山隧道(SK0+780)" : [ 121.62289346736, 38.898909615429 ],
	"公交-高尔基路-太原街" : [ 121.60123573487, 38.904093873283 ],
	"公交-高尔基路-白山路" : [ 121.60532435027, 38.905774098436 ],
	"公交-高尔基路-民运街" : [ 121.61574361025, 38.910127533529 ],
	"公交-高尔基路-纪念街" : [ 121.62371437295, 38.913539070395 ]
};

//东联路卡口
var dllPoint = [ {
	"name" : "东联路-西南路出市上桥",
	"value" : [ 121.589836057, 38.948746534742 ]
}, {
	"name" : "东联路-西南路入市下桥",
	"value" : [ 121.59024647629, 38.949213737346 ]
}, {
	"name" : "东联路-松江路入市上桥",
	"value" : [ 121.5940316301, 38.973543847535 ]
}, {
	"name" : "东联路-华北路入市上桥",
	"value" : [ 121.62414602032, 39.023028038811 ]
}, {
	"name" : "东联路-联合路入市下桥",
	"value" : [ 121.60281031361, 38.930841053481 ]
}, {
	"name" : "东联路-校园街出市下桥",
	"value" : [ 121.61369669276, 39.019102007979 ]
}, {
	"name" : "东联路-中华路(南)出市上桥",
	"value" : [ 121.6026420441, 38.996329318594 ]
}, {
	"name" : "东联路-中华路(南)入市上桥",
	"value" : [ 121.60177622797, 38.996293208837 ]
}, {
	"name" : "东联路-疏港路入市上桥",
	"value" : [ 121.59667422332, 38.93249069093 ]
}, {
	"name" : "东联路-中华路(北)入市下桥",
	"value" : [ 121.60194049173, 38.996908342115 ]
}, {
	"name" : "东联路-中华路(南)出市下桥",
	"value" : [ 121.60242522261, 38.996126196025 ]
}, {
	"name" : "东联路-校园街入市上桥",
	"value" : [ 121.60172325551, 39.001822993123 ]
}, {
	"name" : "东联路-中华路(北)出市下桥",
	"value" : [ 121.60262409077, 38.996701389251 ]
}, {
	"name" : "东联路-松江路出市下桥",
	"value" : [ 121.59425598305, 38.973416741549 ]
}, {
	"name" : "东联路-中华路(南)入市下桥",
	"value" : [ 121.60203884774, 38.996119369302 ]
}, {
	"name" : "东联路-中华路(北)入市上桥",
	"value" : [ 121.6017885704, 38.99667558414 ]
}, {
	"name" : "东联路-中华路(北)出市上桥",
	"value" : [ 121.6023691983, 38.996954550799 ]
}, {
	"name" : "东联路-西安路入市下桥",
	"value" : [ 121.59927125007, 38.932546792968 ]
}, {
	"name" : "东联路-联合路出市上桥",
	"value" : [ 121.60267171566, 38.930837039701 ]
} ];

//星海湾卡口
var xhwPoint = [ {
	"name" : "星海湾大桥BK0+172(B4)",
	"value" : [ 121.61489201416, 38.876829648687 ]
}, {
	"name" : "星海湾大桥XK0+223(X4)",
	"value" : [ 121.61450312368, 38.87728196085 ]
}, {
	"name" : "星海湾大桥XK4+578（X84）",
	"value" : [ 121.5698533249, 38.8721317028 ]
}, {
	"name" : "星海湾大桥SK4+537（S84）",
	"value" : [ 121.56972543624, 38.872523668913 ]
}, {
	"name" : "星海湾大桥AK1+009（B15)",
	"value" : [ 121.61601530929, 38.876831169557 ]
}, {
	"name" : "星海湾大桥SK1+737（S39)",
	"value" : [ 121.60061643516, 38.871228837821 ]
}, {
	"name" : "星海湾大桥SK5+890（S122）",
	"value" : [ 121.55643196354, 38.868655957718 ]
}, {
	"name" : "星海湾大桥XK5+871",
	"value" : [ 121.55694586873, 38.868246712285 ]
}, {
	"name" : "星海湾大桥XK3+654（X63）",
	"value" : [ 121.58602739594, 38.873416621263 ]
}, {
	"name" : "星海湾大桥SK0+940(S20)",
	"value" : [ 121.61397627228, 38.877567490524 ]
}, {
	"name" : "星海湾大桥SK3+613（S63）",
	"value" : [ 121.58614884242, 38.873888402682 ]
}, {
	"name" : "星海湾大桥XK1+778（X39)",
	"value" : [ 121.60052586449, 38.870885383846 ]
}, {
	"name" : "星海湾大桥BHXLK0+060",
	"value" : [ 121.61873284653, 38.875770339912 ]
}, {
	"name" : "星海湾大桥XK0+980(B21）",
	"value" : [ 121.61313179172, 38.874732016892 ]
} ];

var blackMapStyle={
	    'styleJson': [
	                  {
	                      'featureType': 'water',
	                      'elementType': 'all',
	                      'stylers': {
	                          'color': '#031628'
	                      }
	                  },
	                  {
	                      'featureType': 'land',
	                      'elementType': 'geometry',
	                      'stylers': {
	                          'color': '#000102'
	                      }
	                  },
	                  {
	                      'featureType': 'highway',
	                      'elementType': 'all',
	                      'stylers': {
	                          'visibility': 'off'
	                      }
	                  },
	                  {
	                      'featureType': 'arterial',
	                      'elementType': 'geometry.fill',
	                      'stylers': {
	                          'color': '#000000'
	                      }
	                  },
	                  {
	                      'featureType': 'arterial',
	                      'elementType': 'geometry.stroke',
	                      'stylers': {
	                          'color': '#0b3d51'
	                      }
	                  },
	                  {
	                      'featureType': 'local',
	                      'elementType': 'geometry',
	                      'stylers': {
	                          'color': '#000000'
	                      }
	                  },
	                  {
	                      'featureType': 'railway',
	                      'elementType': 'geometry.fill',
	                      'stylers': {
	                          'color': '#000000'
	                      }
	                  },
	                  {
	                      'featureType': 'railway',
	                      'elementType': 'geometry.stroke',
	                      'stylers': {
	                          'color': '#08304b'
	                      }
	                  },
	                  {
	                      'featureType': 'subway',
	                      'elementType': 'geometry',
	                      'stylers': {
	                          'lightness': -70
	                      }
	                  },
	                  {
	                      'featureType': 'building',
	                      'elementType': 'geometry.fill',
	                      'stylers': {
	                          'color': '#000000'
	                      }
	                  },
	                  {
	                      'featureType': 'all',
	                      'elementType': 'labels.text.fill',
	                      'stylers': {
	                          'color': '#857f7f'
	                      }
	                  },
	                  {
	                      'featureType': 'all',
	                      'elementType': 'labels.text.stroke',
	                      'stylers': {
	                          'color': '#000000'
	                      }
	                  },
	                  {
	                      'featureType': 'building',
	                      'elementType': 'geometry',
	                      'stylers': {
	                          'color': '#022338'
	                      }
	                  },
	                  {
	                      'featureType': 'green',
	                      'elementType': 'geometry',
	                      'stylers': {
	                          'color': '#062032'
	                      }
	                  },
	                  {
	                      'featureType': 'boundary',
	                      'elementType': 'all',
	                      'stylers': {
	                          'color': '#465b6c'
	                      }
	                  },
	                  {
	                      'featureType': 'manmade',
	                      'elementType': 'all',
	                      'stylers': {
	                          'color': '#022338'
	                      }
	                  },
	                  {
	                      'featureType': 'label',
	                      'elementType': 'all',
	                      'stylers': {
	                          'visibility': 'off'
	                      }
	                  }
	              ]
	          };
// 地图样式
var blueMapStyle = {
	styleJson : [ {
		'featureType' : 'land', // 调整土地颜色
		'elementType' : 'geometry',
		'stylers' : {
			'color' : '#081734'
		}
	}, {
		'featureType' : 'building', // 调整建筑物颜色
		'elementType' : 'geometry',
		'stylers' : {
			'color' : '#04406F'
		}
	}, {
		'featureType' : 'building', // 调整建筑物标签是否可视
		'elementType' : 'labels',
		'stylers' : {
			'visibility' : 'off'
		}
	}, {
		'featureType' : 'highway', // 调整高速道路颜色
		'elementType' : 'geometry',
		'stylers' : {
			'color' : '#015B99'
		}
	}, {
		'featureType' : 'highway', // 调整高速名字是否可视
		'elementType' : 'labels',
		'stylers' : {
			'visibility' : 'off'
		}
	}, {
		'featureType' : 'arterial', // 调整一些干道颜色
		'elementType' : 'geometry',
		'stylers' : {
			'color' : '#003051'
		}
	}, {
		'featureType' : 'arterial',
		'elementType' : 'labels',
		'stylers' : {
			'visibility' : 'off'
		}
	}, {
		'featureType' : 'green',
		'elementType' : 'geometry',
		'stylers' : {
			'visibility' : 'off'
		}
	}, {
		'featureType' : 'water',
		'elementType' : 'geometry',
		'stylers' : {
			'color' : '#044161'
		}
	}, {
		'featureType' : 'subway', // 调整地铁颜色
		'elementType' : 'geometry.stroke',
		'stylers' : {
			'color' : '#003051'
		}
	}, {
		'featureType' : 'subway',
		'elementType' : 'labels',
		'stylers' : {
			'visibility' : 'off'
		}
	}, {
		'featureType' : 'railway',
		'elementType' : 'geometry',
		'stylers' : {
			'visibility' : 'off'
		}
	}, {
		'featureType' : 'railway',
		'elementType' : 'labels',
		'stylers' : {
			'visibility' : 'off'
		}
	}, {
		'featureType' : 'all', // 调整所有的标签的边缘颜色
		'elementType' : 'labels.text.stroke',
		'stylers' : {
			'color' : '#313131'
		}
	}, {
		'featureType' : 'all', // 调整所有标签的填充颜色
		'elementType' : 'labels.text.fill',
		'stylers' : {
			'color' : '#FFFFFF'
		}
	}, {
		'featureType' : 'manmade',
		'elementType' : 'geometry',
		'stylers' : {
			'visibility' : 'off'
		}
	}, {
		'featureType' : 'manmade',
		'elementType' : 'labels',
		'stylers' : {
			'visibility' : 'off'
		}
	}, {
		'featureType' : 'local',
		'elementType' : 'geometry',
		'stylers' : {
			'visibility' : 'off'
		}
	}, {
		'featureType' : 'local',
		'elementType' : 'labels',
		'stylers' : {
			'visibility' : 'off'
		}
	}, {
		'featureType' : 'subway',
		'elementType' : 'geometry',
		'stylers' : {
			'lightness' : -65
		}
	}, {
		'featureType' : 'railway',
		'elementType' : 'all',
		'stylers' : {
			'lightness' : -40
		}
	}, {
		'featureType' : 'boundary',
		'elementType' : 'geometry',
		'stylers' : {
			'color' : '#8b8787',
			'weight' : '1',
			'lightness' : -29
		}
	} ]
};

